---
kind: type
id: T:Autodesk.Revit.Attributes.TransactionMode
source: html/84254a1f-7bba-885a-ce65-e68fc238fddb.htm
---
# Autodesk.Revit.Attributes.TransactionMode

All transaction modes supported by Revit external commands.

## Syntax (C#)
```csharp
public enum TransactionMode
```